#+TITLE: Emacs Speech Input

Personal set of tools for involving speech while working with Emacs. Once
stable, this place should provide a consistent API involving various kinds of
speech based acts and delegate to various backends.

The API will cover pieces like:
1. Voice activity detection
2. Hot word detection
3. Speaker Verification
4. Regular utterance transcription

For now, I am trying to set up a regular command-and-control stuff based on 4th
method using a kaldi backend.

A basic method working to get utterance transcription is:

#+begin_src emacs-lisp :exports both :results value
(esi-kaldi-transcribe (esi-record))
#+end_src

#+RESULTS:
| results | ((alternatives ((transcript . hello world) (confidence . 0.9549557) (amScore . -93.48753) (lmScore . 48.08582)) ((transcript . allow world) (confidence . 0.9546335) (amScore . -95.37911) (lmScore . 51.637577)) ((transcript . allow word) (confidence . 0.9543697) (amScore . -96.77035) (lmScore . 54.479374)))) |
